%%%% в этом файле задаются параметры рассматриваемой системы

global EE  a_0 c w ee k_0 q Theta Psi N_max cylX cylY cylXY L E0z H0z p k
                           

e_0 = 4.8e-10;
m_e = 9.1e-28;
c = 3e10;        % velocity of light
H0 = 0.5;        %внешнее магнитное поле
w_H = (e_0 * H0) / (m_e * c);
w_0  = 1.1 * w_H;    % правый резонанс для пучка на m=1 при n=0 и p_beam = s_beam
channelparameters;

c = 3e10;                 % скорость света
ee = 1;                   % диэлектрическая проницаемость в свобдном пространстве


% w_0    = 4.9745 * w_H;
% w_0    = 6.4721 * w_H;
% w_0    = 6.4921 * w_H;
% w_0    = 0.01 * w_H;
w = w_0;
channelparameters;        % параметры плазмы отдельно цилиндра

%%% элементы тензора диэлектрического цилиндра без дисперсии
% EE = 20;
% GG = 1e-8;
% HH = 20;
% w_0 = 10 * w_0;

% a_0   = 100;
% L     = 5 * 4391.1901;           % решётчатый резонанс для второго 
L = 3 * a_0;


% q = sqrt((EE.^2 - GG.^2)./EE); % нормированная поперечная постоянная распространения внутри цилиндра
Theta = pi / 4;                % угол падения в плоскости XY
Theta = pi / 2;                    % угол падения в плоскости XY

Psi = 0.0001 * pi / 6;                       % угол падения в плоскости ZX
p = sin(Theta) * sin(Psi)
% % p = 30.89;
p = sqrt(1/2);

k_0 =  w_0 / c;      % постоянная распространения падающей волны в свободном пространстве
kL2pi =  k_0 * L / 2/pi        % нужный иногда параметр
ka =  k_0 * a_0

%%%%% задаём максимально используемое при расчётах значение азимутального 
%%%%% индекса и количество цилиндров
    N_max       = 3;
    N_cylinders = 2;
    
%%%%% амплитуды каждой из поляризаций
      E0z = 0;
      H0z = 1;

%%%%% задаём координаты центров цилиндров
    %%%% для gyrotropicCrystal
        cylY = [-(N_cylinders - 1)/2:(N_cylinders - 1)/2] * (L) + 0.0001;
        cylX = [1:N_cylinders] * 0;    
    %%%% для gyrotropicCrystal2D
%         cylXY = [-L -L; -L 0; -L L; 0 -L; 0 0; 0 L; L -L; L 0; L L]
%         cylXY = [0 (-L/2 + 0.0001); 0 (L/2 + 0.0001)];
%           cylXY = [(-L/2) (-L/2 + 0.0001); (-L/2) (L/2 + 0.0001); (L/2) (-L/2 + 0.0001); (L/2) (L/2 + 0.0001);...
%                    (-L/2) (-3*L/2 + 0.0001); (-L/2) (3*L/2 + 0.0001); (L/2) (-3*L/2 + 0.0001); (L/2) (3*L/2 + 0.0001);...
%                    (-L/2) (-5*L/2 + 0.0001); (-L/2) (5*L/2 + 0.0001); (L/2) (-5*L/2 + 0.0001); (L/2) (5*L/2 + 0.0001)];

%                 cylXY = -[-L/2 0; -L/2 L; L/2 0;L/2 L];
%                 cylXY = [L/2 0; -L/2 0;];
               cylXY = [(0) (0.001); -L 0];
%                cylXY = [(-L/2) (-L/2); (-L/2) (L/2); (L/2) (-L/2); (L/2) (L/2)];
%           cylXY = [(-L/2) (-L/2); (-L/2) (L/2); (L/2) (-L/2); (L/2) (L/2);...
%                    (-L/2) (-3*L/2); (-L/2) (3*L/2); (L/2) (-3*L/2); (L/2) (3*L/2);...
%                    (-L/2) (-5*L/2); (-L/2) (5*L/2); (L/2) (-5*L/2); (L/2) (5*L/2)];


           cylXY = [(0) (0.001)];
%          cylXY = [(0) (0.001); -L (0.001)];
         cylXY = [(0) (0.001)];
         cylXY = [(0) (0.001); -L 0];

